IDENTIFICATION DIVISION.
PROGRAM-ID. FUNCTIONS.

DATA DIVISION.
      WORKING-STORAGE SECTION.

      01 WS-TABLE.
       05 WS-NUMBERS OCCURS 5 TIMES INDEXED BY I.
           10 WS-NUM PIC 9(01).
      01 WS-INPUT PIC 9(01) VALUE ZERO.
      01 COUNTER PIC 9(01) VALUE 0.
      01 WS-SMALLEST PIC 9(1) VALUE 9.
      01 WS-LARGEST PIC 9(1) VALUE 0.
      01 WS-MODE PIC 9(1) VALUE ZERO.
      01 OCCUR PIC 9(01) VALUE 0.
      01 WS-MAX-COUNT PIC 9(01) VALUE 0.
      01 J PIC 9(01) VALUE 0.

PROCEDURE DIVISION.

       PERFORM READDATA UNTIL COUNTER = 5.
       DISPLAY "THE VALUES IN THE ARRAY: " WS-TABLE.
 
       PERFORM FINDTHESMALLEST.
       DISPLAY "THE SMALLEST VALUE = "WS-SMALLEST.

       PERFORM FINDLARGEST.
       DISPLAY "THE LARGEST VALUE = "WS-LARGEST.

       PERFORM CALCULATE-MODE.
       DISPLAY "MODE OF THE ARRAY = "WS-MODE.

       STOP RUN.
READDATA.
      DISPLAY "ENTER AN INTEGER NUMBER: "
      ACCEPT WS-INPUT.

      MOVE WS-INPUT TO WS-NUM(I).
      ADD 1 TO COUNTER.
      SET I UP BY 1.

FINDTHESMALLEST.
     SET I TO 1
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        IF WS-NUM(I) < WS-SMALLEST
            MOVE WS-NUM(I) TO WS-SMALLEST
        END-IF
    END-PERFORM.

FINDLARGEST.
       SET I TO 1
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
           IF WS-NUM(I) > WS-LARGEST
               MOVE WS-NUM(I) TO WS-LARGEST
           END-IF 
       END-PERFORM.

CALCULATE-MODE.
      SET I TO 1
      PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
       SET OCCUR TO 0
       SET J TO 1
          PERFORM VARYING  J FROM 1 BY 1 UNTIL J > 5
           IF WS-NUM(I) = WS-NUM(J)
               ADD 1 TO OCCUR
           END-IF 
           END-PERFORM
       IF OCCUR > WS-MAX-COUNT
           MOVE WS-NUM(I) TO WS-MODE
           MOVE OCCUR TO WS-MAX-COUNT
       END-IF 
      END-PERFORM.
